# SpatialElementGeometryCalculator Constructor

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SpatialElementGeometryCalculator Constructor
SpatialElementGeometryCalculator Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| SpatialElementGeometryCalculator(Document) | Constructs a new calculator with default options for the geometry of spatial elements. |
| SpatialElementGeometryCalculator(Document, SpatialElementBoundaryOptions) | Constructs a new calculator for the geometry of spatial elements. |

# See Also
SpatialElementGeometryCalculator Class
SpatialElementGeometryCalculator Members
Autodesk.Revit.DB Namespace